[
    {
        "input_text": "what was the rating on the movie 10 things i hate about you?"
    },
    {
        "target_text": "The IMDb rating on 10 things i hate about you is 6.90."
    },
    {
        "input_text": "what was the rating on the movie 1492: conquest of paradise?"
    },
    {
        "target_text": "The IMDb rating on 1492: conquest of paradise is 6.20."
    },
    {
        "input_text": "what was the rating on the movie 15 minutes?"
    },
    {
        "target_text": "The IMDb rating on 15 minutes is 6.10."
    },
    {
        "input_text": "what was the rating on the movie 2001: a space odyssey?"
    },
    {
        "target_text": "The IMDb rating on 2001: a space odyssey is 8.40."
    },
    {
        "input_text": "what was the rating on the movie 48 hrs.?"
    },
    {
        "target_text": "The IMDb rating on 48 hrs. is 6.90."
    },
    {
        "input_text": "what was the rating on the movie The fifth element?"
    },
    {
        "target_text": "The IMDb rating on The fifth element is 7.50."
    },
    {
        "input_text": "what was the rating on the movie 8mm?"
    },
    {
        "target_text": "The IMDb rating on 8mm is 6.30."
    },
    {
        "input_text": "what was the rating on the movie A nightmare on elm street 4: the dream master?"
    },
    {
        "target_text": "The IMDb rating on A nightmare on elm street 4: the dream master is 5.20."
    },
    {
        "input_text": "what was the rating on the movie A nightmare on elm street: the dream child?"
    },
    {
        "target_text": "The IMDb rating on A nightmare on elm street: the dream child is 4.70."
    },
    {
        "input_text": "what was the rating on the movie The atomic submarine?"
    },
    {
        "target_text": "The IMDb rating on The atomic submarine is 4.90."
    },
    {
        "input_text": "what was the rating on the movie Affliction?"
    },
    {
        "target_text": "The IMDb rating on Affliction is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Air force one?"
    },
    {
        "target_text": "The IMDb rating on Air force one is 6.30."
    },
    {
        "input_text": "what was the rating on the movie Airplane ii: the sequel?"
    },
    {
        "target_text": "The IMDb rating on Airplane ii: the sequel is 5.80."
    },
    {
        "input_text": "what was the rating on the movie Airplane!?"
    },
    {
        "target_text": "The IMDb rating on Airplane! is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Alien nation?"
    },
    {
        "target_text": "The IMDb rating on Alien nation is 6.10."
    },
    {
        "input_text": "what was the rating on the movie Aliens?"
    },
    {
        "target_text": "The IMDb rating on Aliens is 8.50."
    },
    {
        "input_text": "what was the rating on the movie Amadeus?"
    },
    {
        "target_text": "The IMDb rating on Amadeus is 8.40."
    },
    {
        "input_text": "what was the rating on the movie An american werewolf in london?"
    },
    {
        "target_text": "The IMDb rating on An american werewolf in london is 7.50."
    },
    {
        "input_text": "what was the rating on the movie American madness?"
    },
    {
        "target_text": "The IMDb rating on American madness is 7.40."
    },
    {
        "input_text": "what was the rating on the movie American outlaws?"
    },
    {
        "target_text": "The IMDb rating on American outlaws is 5.70."
    },
    {
        "input_text": "what was the rating on the movie American psycho?"
    },
    {
        "target_text": "The IMDb rating on American psycho is 7.40."
    },
    {
        "input_text": "what was the rating on the movie Antitrust?"
    },
    {
        "target_text": "The IMDb rating on Antitrust is 6.00."
    },
    {
        "input_text": "what was the rating on the movie Austin powers: international man of mystery?"
    },
    {
        "target_text": "The IMDb rating on Austin powers: international man of mystery is 7.10."
    },
    {
        "input_text": "what was the rating on the movie The avengers?"
    },
    {
        "target_text": "The IMDb rating on The avengers is 3.40."
    },
    {
        "input_text": "what was the rating on the movie Bachelor party?"
    },
    {
        "target_text": "The IMDb rating on Bachelor party is 5.90."
    },
    {
        "input_text": "what was the rating on the movie Backdraft?"
    },
    {
        "target_text": "The IMDb rating on Backdraft is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Bad lieutenant?"
    },
    {
        "target_text": "The IMDb rating on Bad lieutenant is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Bamboozled?"
    },
    {
        "target_text": "The IMDb rating on Bamboozled is 6.30."
    },
    {
        "input_text": "what was the rating on the movie Barry lyndon?"
    },
    {
        "target_text": "The IMDb rating on Barry lyndon is 8.10."
    },
    {
        "input_text": "what was the rating on the movie Basic?"
    },
    {
        "target_text": "The IMDb rating on Basic is 6.30."
    },
    {
        "input_text": "what was the rating on the movie Big fish?"
    },
    {
        "target_text": "The IMDb rating on Big fish is 8.10."
    },
    {
        "input_text": "what was the rating on the movie Birthday girl?"
    },
    {
        "target_text": "The IMDb rating on Birthday girl is 6.00."
    },
    {
        "input_text": "what was the rating on the movie Black snake moan?"
    },
    {
        "target_text": "The IMDb rating on Black snake moan is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Black rain?"
    },
    {
        "target_text": "The IMDb rating on Black rain is 6.40."
    },
    {
        "input_text": "what was the rating on the movie Blade runner?"
    },
    {
        "target_text": "The IMDb rating on Blade runner is 8.30."
    },
    {
        "input_text": "what was the rating on the movie Blast from the past?"
    },
    {
        "target_text": "The IMDb rating on Blast from the past is 6.40."
    },
    {
        "input_text": "what was the rating on the movie Blue velvet?"
    },
    {
        "target_text": "The IMDb rating on Blue velvet is 7.80."
    },
    {
        "input_text": "what was the rating on the movie The boondock saints?"
    },
    {
        "target_text": "The IMDb rating on The boondock saints is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Bottle rocket?"
    },
    {
        "target_text": "The IMDb rating on Bottle rocket is 7.20."
    },
    {
        "input_text": "what was the rating on the movie The bourne supremacy?"
    },
    {
        "target_text": "The IMDb rating on The bourne supremacy is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Braveheart?"
    },
    {
        "target_text": "The IMDb rating on Braveheart is 8.40."
    },
    {
        "input_text": "what was the rating on the movie The butterfly effect?"
    },
    {
        "target_text": "The IMDb rating on The butterfly effect is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Casablanca?"
    },
    {
        "target_text": "The IMDb rating on Casablanca is 8.80."
    },
    {
        "input_text": "what was the rating on the movie Cast away?"
    },
    {
        "target_text": "The IMDb rating on Cast away is 7.50."
    },
    {
        "input_text": "what was the rating on the movie The cider house rules?"
    },
    {
        "target_text": "The IMDb rating on The cider house rules is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Confidence?"
    },
    {
        "target_text": "The IMDb rating on Confidence is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Croupier?"
    },
    {
        "target_text": "The IMDb rating on Croupier is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Dark star?"
    },
    {
        "target_text": "The IMDb rating on Dark star is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Dark angel?"
    },
    {
        "target_text": "The IMDb rating on Dark angel is 5.30."
    },
    {
        "input_text": "what was the rating on the movie Detroit rock city?"
    },
    {
        "target_text": "The IMDb rating on Detroit rock city is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Donnie darko?"
    },
    {
        "target_text": "The IMDb rating on Donnie darko is 8.30."
    },
    {
        "input_text": "what was the rating on the movie Drop dead gorgeous?"
    },
    {
        "target_text": "The IMDb rating on Drop dead gorgeous is 6.30."
    },
    {
        "input_text": "what was the rating on the movie Duck soup?"
    },
    {
        "target_text": "The IMDb rating on Duck soup is 8.10."
    },
    {
        "input_text": "what was the rating on the movie The elephant man?"
    },
    {
        "target_text": "The IMDb rating on The elephant man is 8.40."
    },
    {
        "input_text": "what was the rating on the movie Erik the viking?"
    },
    {
        "target_text": "The IMDb rating on Erik the viking is 5.90."
    },
    {
        "input_text": "what was the rating on the movie Eternal sunshine of the spotless mind?"
    },
    {
        "target_text": "The IMDb rating on Eternal sunshine of the spotless mind is 8.50."
    },
    {
        "input_text": "what was the rating on the movie Even cowgirls get the blues?"
    },
    {
        "target_text": "The IMDb rating on Even cowgirls get the blues is 4.00."
    },
    {
        "input_text": "what was the rating on the movie Event horizon?"
    },
    {
        "target_text": "The IMDb rating on Event horizon is 6.40."
    },
    {
        "input_text": "what was the rating on the movie Fantastic four?"
    },
    {
        "target_text": "The IMDb rating on Fantastic four is 5.70."
    },
    {
        "input_text": "what was the rating on the movie Fast times at ridgemont high?"
    },
    {
        "target_text": "The IMDb rating on Fast times at ridgemont high is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Fear and loathing in las vegas?"
    },
    {
        "target_text": "The IMDb rating on Fear and loathing in las vegas is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Feast?"
    },
    {
        "target_text": "The IMDb rating on Feast is 6.40."
    },
    {
        "input_text": "what was the rating on the movie Frances?"
    },
    {
        "target_text": "The IMDb rating on Frances is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Frankenstein?"
    },
    {
        "target_text": "The IMDb rating on Frankenstein is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Friday the 13th?"
    },
    {
        "target_text": "The IMDb rating on Friday the 13th is 5.60."
    },
    {
        "input_text": "what was the rating on the movie From dusk till dawn?"
    },
    {
        "target_text": "The IMDb rating on From dusk till dawn is 7.10."
    },
    {
        "input_text": "what was the rating on the movie G.i. jane?"
    },
    {
        "target_text": "The IMDb rating on G.i. jane is 5.60."
    },
    {
        "input_text": "what was the rating on the movie Godzilla?"
    },
    {
        "target_text": "The IMDb rating on Godzilla is 4.90."
    },
    {
        "input_text": "what was the rating on the movie Galaxy quest?"
    },
    {
        "target_text": "The IMDb rating on Galaxy quest is 7.20."
    },
    {
        "input_text": "what was the rating on the movie George washington?"
    },
    {
        "target_text": "The IMDb rating on George washington is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Get shorty?"
    },
    {
        "target_text": "The IMDb rating on Get shorty is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Ghost ship?"
    },
    {
        "target_text": "The IMDb rating on Ghost ship is 5.30."
    },
    {
        "input_text": "what was the rating on the movie Ghost world?"
    },
    {
        "target_text": "The IMDb rating on Ghost world is 7.70."
    },
    {
        "input_text": "what was the rating on the movie The ghost and the darkness?"
    },
    {
        "target_text": "The IMDb rating on The ghost and the darkness is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Ghostbusters ii?"
    },
    {
        "target_text": "The IMDb rating on Ghostbusters ii is 6.10."
    },
    {
        "input_text": "what was the rating on the movie Ghostbusters?"
    },
    {
        "target_text": "The IMDb rating on Ghostbusters is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Gladiator?"
    },
    {
        "target_text": "The IMDb rating on Gladiator is 8.40."
    },
    {
        "input_text": "what was the rating on the movie The graduate?"
    },
    {
        "target_text": "The IMDb rating on The graduate is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Grand hotel?"
    },
    {
        "target_text": "The IMDb rating on Grand hotel is 7.70."
    },
    {
        "input_text": "what was the rating on the movie The grifters?"
    },
    {
        "target_text": "The IMDb rating on The grifters is 7.00."
    },
    {
        "input_text": "what was the rating on the movie Halloween h20: 20 years later?"
    },
    {
        "target_text": "The IMDb rating on Halloween h20: 20 years later is 5.40."
    },
    {
        "input_text": "what was the rating on the movie Halloween: the curse of michael myers?"
    },
    {
        "target_text": "The IMDb rating on Halloween: the curse of michael myers is 4.50."
    },
    {
        "input_text": "what was the rating on the movie Happy birthday, wanda june?"
    },
    {
        "target_text": "The IMDb rating on Happy birthday, wanda june is 5.80."
    },
    {
        "input_text": "what was the rating on the movie Hardcore?"
    },
    {
        "target_text": "The IMDb rating on Hardcore is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Harold and maude?"
    },
    {
        "target_text": "The IMDb rating on Harold and maude is 8.10."
    },
    {
        "input_text": "what was the rating on the movie Hellbound: hellraiser ii?"
    },
    {
        "target_text": "The IMDb rating on Hellbound: hellraiser ii is 6.20."
    },
    {
        "input_text": "what was the rating on the movie Hellboy?"
    },
    {
        "target_text": "The IMDb rating on Hellboy is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Hellraiser?"
    },
    {
        "target_text": "The IMDb rating on Hellraiser is 7.00."
    },
    {
        "input_text": "what was the rating on the movie High fidelity?"
    },
    {
        "target_text": "The IMDb rating on High fidelity is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Highlander?"
    },
    {
        "target_text": "The IMDb rating on Highlander is 7.20."
    },
    {
        "input_text": "what was the rating on the movie His girl friday?"
    },
    {
        "target_text": "The IMDb rating on His girl friday is 8.10."
    },
    {
        "input_text": "what was the rating on the movie Hope and glory?"
    },
    {
        "target_text": "The IMDb rating on Hope and glory is 7.40."
    },
    {
        "input_text": "what was the rating on the movie House of 1000 corpses?"
    },
    {
        "target_text": "The IMDb rating on House of 1000 corpses is 5.60."
    },
    {
        "input_text": "what was the rating on the movie Human nature?"
    },
    {
        "target_text": "The IMDb rating on Human nature is 6.30."
    },
    {
        "input_text": "what was the rating on the movie The hustler?"
    },
    {
        "target_text": "The IMDb rating on The hustler is 8.20."
    },
    {
        "input_text": "what was the rating on the movie I am legend?"
    },
    {
        "target_text": "The IMDb rating on I am legend is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Invaders from mars?"
    },
    {
        "target_text": "The IMDb rating on Invaders from mars is 6.40."
    },
    {
        "input_text": "what was the rating on the movie Independence day?"
    },
    {
        "target_text": "The IMDb rating on Independence day is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Indiana jones and the last crusade?"
    },
    {
        "target_text": "The IMDb rating on Indiana jones and the last crusade is 8.30."
    },
    {
        "input_text": "what was the rating on the movie Indiana jones and the temple of doom?"
    },
    {
        "target_text": "The IMDb rating on Indiana jones and the temple of doom is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Innerspace?"
    },
    {
        "target_text": "The IMDb rating on Innerspace is 6.50."
    },
    {
        "input_text": "what was the rating on the movie The insider?"
    },
    {
        "target_text": "The IMDb rating on The insider is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Intolerable cruelty?"
    },
    {
        "target_text": "The IMDb rating on Intolerable cruelty is 6.40."
    },
    {
        "input_text": "what was the rating on the movie It happened one night?"
    },
    {
        "target_text": "The IMDb rating on It happened one night is 8.30."
    },
    {
        "input_text": "what was the rating on the movie Jfk?"
    },
    {
        "target_text": "The IMDb rating on Jfk is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Jackie brown?"
    },
    {
        "target_text": "The IMDb rating on Jackie brown is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Jacob's ladder?"
    },
    {
        "target_text": "The IMDb rating on Jacob's ladder is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Jason x?"
    },
    {
        "target_text": "The IMDb rating on Jason x is 4.40."
    },
    {
        "input_text": "what was the rating on the movie Jaws?"
    },
    {
        "target_text": "The IMDb rating on Jaws is 8.30."
    },
    {
        "input_text": "what was the rating on the movie Juno?"
    },
    {
        "target_text": "The IMDb rating on Juno is 7.90."
    },
    {
        "input_text": "what was the rating on the movie Kalifornia?"
    },
    {
        "target_text": "The IMDb rating on Kalifornia is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Kids?"
    },
    {
        "target_text": "The IMDb rating on Kids is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Knight moves?"
    },
    {
        "target_text": "The IMDb rating on Knight moves is 5.80."
    },
    {
        "input_text": "what was the rating on the movie Krull?"
    },
    {
        "target_text": "The IMDb rating on Krull is 5.90."
    },
    {
        "input_text": "what was the rating on the movie Léon?"
    },
    {
        "target_text": "The IMDb rating on Léon is 8.60."
    },
    {
        "input_text": "what was the rating on the movie Labor of love?"
    },
    {
        "target_text": "The IMDb rating on Labor of love is 4.50."
    },
    {
        "input_text": "what was the rating on the movie Leaving las vegas?"
    },
    {
        "target_text": "The IMDb rating on Leaving las vegas is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Legally blonde?"
    },
    {
        "target_text": "The IMDb rating on Legally blonde is 6.20."
    },
    {
        "input_text": "what was the rating on the movie Legend?"
    },
    {
        "target_text": "The IMDb rating on Legend is 6.20."
    },
    {
        "input_text": "what was the rating on the movie Life as a house?"
    },
    {
        "target_text": "The IMDb rating on Life as a house is 7.50."
    },
    {
        "input_text": "what was the rating on the movie The life of david gale?"
    },
    {
        "target_text": "The IMDb rating on The life of david gale is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Little nicky?"
    },
    {
        "target_text": "The IMDb rating on Little nicky is 5.00."
    },
    {
        "input_text": "what was the rating on the movie Logan's run?"
    },
    {
        "target_text": "The IMDb rating on Logan's run is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Lost highway?"
    },
    {
        "target_text": "The IMDb rating on Lost highway is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Lost horizon?"
    },
    {
        "target_text": "The IMDb rating on Lost horizon is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Men in black?"
    },
    {
        "target_text": "The IMDb rating on Men in black is 7.00."
    },
    {
        "input_text": "what was the rating on the movie Minority report?"
    },
    {
        "target_text": "The IMDb rating on Minority report is 7.70."
    },
    {
        "input_text": "what was the rating on the movie Made?"
    },
    {
        "target_text": "The IMDb rating on Made is 6.40."
    },
    {
        "input_text": "what was the rating on the movie Malcolm x?"
    },
    {
        "target_text": "The IMDb rating on Malcolm x is 7.70."
    },
    {
        "input_text": "what was the rating on the movie Man on fire?"
    },
    {
        "target_text": "The IMDb rating on Man on fire is 7.70."
    },
    {
        "input_text": "what was the rating on the movie Marty?"
    },
    {
        "target_text": "The IMDb rating on Marty is 7.70."
    },
    {
        "input_text": "what was the rating on the movie Mash?"
    },
    {
        "target_text": "The IMDb rating on Mash is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Meet john doe?"
    },
    {
        "target_text": "The IMDb rating on Meet john doe is 7.70."
    },
    {
        "input_text": "what was the rating on the movie Metro?"
    },
    {
        "target_text": "The IMDb rating on Metro is 5.30."
    },
    {
        "input_text": "what was the rating on the movie Metropolis?"
    },
    {
        "target_text": "The IMDb rating on Metropolis is 8.40."
    },
    {
        "input_text": "what was the rating on the movie Mighty morphin power rangers?"
    },
    {
        "target_text": "The IMDb rating on Mighty morphin power rangers is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Mobsters?"
    },
    {
        "target_text": "The IMDb rating on Mobsters is 5.50."
    },
    {
        "input_text": "what was the rating on the movie Monkeybone?"
    },
    {
        "target_text": "The IMDb rating on Monkeybone is 4.50."
    },
    {
        "input_text": "what was the rating on the movie My mother dreams the satan's disciples in new york?"
    },
    {
        "target_text": "The IMDb rating on My mother dreams the satan's disciples in new york is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Mr. smith goes to washington?"
    },
    {
        "target_text": "The IMDb rating on Mr. smith goes to washington is 8.40."
    },
    {
        "input_text": "what was the rating on the movie Mr. deeds goes to town?"
    },
    {
        "target_text": "The IMDb rating on Mr. deeds goes to town is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Mumford?"
    },
    {
        "target_text": "The IMDb rating on Mumford is 6.80."
    },
    {
        "input_text": "what was the rating on the movie The mummy?"
    },
    {
        "target_text": "The IMDb rating on The mummy is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Mystery men?"
    },
    {
        "target_text": "The IMDb rating on Mystery men is 5.90."
    },
    {
        "input_text": "what was the rating on the movie Napoleon?"
    },
    {
        "target_text": "The IMDb rating on Napoleon is 5.50."
    },
    {
        "input_text": "what was the rating on the movie Next friday?"
    },
    {
        "target_text": "The IMDb rating on Next friday is 5.40."
    },
    {
        "input_text": "what was the rating on the movie Nick of time?"
    },
    {
        "target_text": "The IMDb rating on Nick of time is 6.20."
    },
    {
        "input_text": "what was the rating on the movie The night of the hunter?"
    },
    {
        "target_text": "The IMDb rating on The night of the hunter is 8.20."
    },
    {
        "input_text": "what was the rating on the movie A nightmare on elm street?"
    },
    {
        "target_text": "The IMDb rating on A nightmare on elm street is 7.40."
    },
    {
        "input_text": "what was the rating on the movie Ninotchka?"
    },
    {
        "target_text": "The IMDb rating on Ninotchka is 7.90."
    },
    {
        "input_text": "what was the rating on the movie Nixon?"
    },
    {
        "target_text": "The IMDb rating on Nixon is 7.10."
    },
    {
        "input_text": "what was the rating on the movie No country for old men?"
    },
    {
        "target_text": "The IMDb rating on No country for old men is 8.30."
    },
    {
        "input_text": "what was the rating on the movie Nurse betty?"
    },
    {
        "target_text": "The IMDb rating on Nurse betty is 6.40."
    },
    {
        "input_text": "what was the rating on the movie O brother, where art thou??"
    },
    {
        "target_text": "The IMDb rating on O brother, where art thou? is 7.80."
    },
    {
        "input_text": "what was the rating on the movie An officer and a gentleman?"
    },
    {
        "target_text": "The IMDb rating on An officer and a gentleman is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Panic room?"
    },
    {
        "target_text": "The IMDb rating on Panic room is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Panther?"
    },
    {
        "target_text": "The IMDb rating on Panther is 5.90."
    },
    {
        "input_text": "what was the rating on the movie The patriot?"
    },
    {
        "target_text": "The IMDb rating on The patriot is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Pet sematary?"
    },
    {
        "target_text": "The IMDb rating on Pet sematary is 6.30."
    },
    {
        "input_text": "what was the rating on the movie Pirates of the caribbean?"
    },
    {
        "target_text": "The IMDb rating on Pirates of the caribbean is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Plastic man?"
    },
    {
        "target_text": "The IMDb rating on Plastic man is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Platinum blonde?"
    },
    {
        "target_text": "The IMDb rating on Platinum blonde is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Pleasantville?"
    },
    {
        "target_text": "The IMDb rating on Pleasantville is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Punch-drunk love?"
    },
    {
        "target_text": "The IMDb rating on Punch-drunk love is 7.40."
    },
    {
        "input_text": "what was the rating on the movie Quills?"
    },
    {
        "target_text": "The IMDb rating on Quills is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Rko 281?"
    },
    {
        "target_text": "The IMDb rating on Rko 281 is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Raging bull?"
    },
    {
        "target_text": "The IMDb rating on Raging bull is 8.40."
    },
    {
        "input_text": "what was the rating on the movie Rear window?"
    },
    {
        "target_text": "The IMDb rating on Rear window is 8.70."
    },
    {
        "input_text": "what was the rating on the movie Rebel without a cause?"
    },
    {
        "target_text": "The IMDb rating on Rebel without a cause is 7.90."
    },
    {
        "input_text": "what was the rating on the movie Reindeer games?"
    },
    {
        "target_text": "The IMDb rating on Reindeer games is 5.50."
    },
    {
        "input_text": "what was the rating on the movie Reservoir dogs?"
    },
    {
        "target_text": "The IMDb rating on Reservoir dogs is 8.40."
    },
    {
        "input_text": "what was the rating on the movie Roughshod?"
    },
    {
        "target_text": "The IMDb rating on Roughshod is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Scary movie 2?"
    },
    {
        "target_text": "The IMDb rating on Scary movie 2 is 4.70."
    },
    {
        "input_text": "what was the rating on the movie Serial mom?"
    },
    {
        "target_text": "The IMDb rating on Serial mom is 6.40."
    },
    {
        "input_text": "what was the rating on the movie The seventh victim?"
    },
    {
        "target_text": "The IMDb rating on The seventh victim is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Sex, lies, and videotape?"
    },
    {
        "target_text": "The IMDb rating on Sex, lies, and videotape is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Shivers?"
    },
    {
        "target_text": "The IMDb rating on Shivers is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Shock treatment?"
    },
    {
        "target_text": "The IMDb rating on Shock treatment is 5.40."
    },
    {
        "input_text": "what was the rating on the movie Sideways?"
    },
    {
        "target_text": "The IMDb rating on Sideways is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Signs?"
    },
    {
        "target_text": "The IMDb rating on Signs is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Silverado?"
    },
    {
        "target_text": "The IMDb rating on Silverado is 7.00."
    },
    {
        "input_text": "what was the rating on the movie Simone?"
    },
    {
        "target_text": "The IMDb rating on Simone is 8.30."
    },
    {
        "input_text": "what was the rating on the movie The sixth sense?"
    },
    {
        "target_text": "The IMDb rating on The sixth sense is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Slash?"
    },
    {
        "target_text": "The IMDb rating on Slash is 4.20."
    },
    {
        "input_text": "what was the rating on the movie Slither?"
    },
    {
        "target_text": "The IMDb rating on Slither is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Smokey and the bandit?"
    },
    {
        "target_text": "The IMDb rating on Smokey and the bandit is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Smokin' aces?"
    },
    {
        "target_text": "The IMDb rating on Smokin' aces is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Solaris?"
    },
    {
        "target_text": "The IMDb rating on Solaris is 6.20."
    },
    {
        "input_text": "what was the rating on the movie Someone to watch over me?"
    },
    {
        "target_text": "The IMDb rating on Someone to watch over me is 6.10."
    },
    {
        "input_text": "what was the rating on the movie Spider-man?"
    },
    {
        "target_text": "The IMDb rating on Spider-man is 7.40."
    },
    {
        "input_text": "what was the rating on the movie Stalag 17?"
    },
    {
        "target_text": "The IMDb rating on Stalag 17 is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Star trek: generations?"
    },
    {
        "target_text": "The IMDb rating on Star trek: generations is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Star trek iii: the search for spock?"
    },
    {
        "target_text": "The IMDb rating on Star trek iii: the search for spock is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Star trek: the wrath of khan?"
    },
    {
        "target_text": "The IMDb rating on Star trek: the wrath of khan is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Star trek iv: the voyage home?"
    },
    {
        "target_text": "The IMDb rating on Star trek iv: the voyage home is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Star trek: insurrection?"
    },
    {
        "target_text": "The IMDb rating on Star trek: insurrection is 6.30."
    },
    {
        "input_text": "what was the rating on the movie Star trek: first contact?"
    },
    {
        "target_text": "The IMDb rating on Star trek: first contact is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Star trek vi: the undiscovered country?"
    },
    {
        "target_text": "The IMDb rating on Star trek vi: the undiscovered country is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Star trek: nemesis?"
    },
    {
        "target_text": "The IMDb rating on Star trek: nemesis is 6.40."
    },
    {
        "input_text": "what was the rating on the movie Starman?"
    },
    {
        "target_text": "The IMDb rating on Starman is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Strange days?"
    },
    {
        "target_text": "The IMDb rating on Strange days is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Suspect zero?"
    },
    {
        "target_text": "The IMDb rating on Suspect zero is 5.80."
    },
    {
        "input_text": "what was the rating on the movie Swingers?"
    },
    {
        "target_text": "The IMDb rating on Swingers is 7.60."
    },
    {
        "input_text": "what was the rating on the movie The godfather?"
    },
    {
        "target_text": "The IMDb rating on The godfather is 9.20."
    },
    {
        "input_text": "what was the rating on the movie The talented mr. ripley?"
    },
    {
        "target_text": "The IMDb rating on The talented mr. ripley is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Taxi driver?"
    },
    {
        "target_text": "The IMDb rating on Taxi driver is 8.60."
    },
    {
        "input_text": "what was the rating on the movie The rock?"
    },
    {
        "target_text": "The IMDb rating on The rock is 7.30."
    },
    {
        "input_text": "what was the rating on the movie The majestic?"
    },
    {
        "target_text": "The IMDb rating on The majestic is 6.80."
    },
    {
        "input_text": "what was the rating on the movie The birds?"
    },
    {
        "target_text": "The IMDb rating on The birds is 7.90."
    },
    {
        "input_text": "what was the rating on the movie The body snatcher?"
    },
    {
        "target_text": "The IMDb rating on The body snatcher is 7.40."
    },
    {
        "input_text": "what was the rating on the movie The crow: salvation?"
    },
    {
        "target_text": "The IMDb rating on The crow: salvation is 4.70."
    },
    {
        "input_text": "what was the rating on the movie The day the earth stood still?"
    },
    {
        "target_text": "The IMDb rating on The day the earth stood still is 5.50."
    },
    {
        "input_text": "what was the rating on the movie The lost boys?"
    },
    {
        "target_text": "The IMDb rating on The lost boys is 7.00."
    },
    {
        "input_text": "what was the rating on the movie The thing?"
    },
    {
        "target_text": "The IMDb rating on The thing is 8.20."
    },
    {
        "input_text": "what was the rating on the movie The time machine?"
    },
    {
        "target_text": "The IMDb rating on The time machine is 5.70."
    },
    {
        "input_text": "what was the rating on the movie The jacket?"
    },
    {
        "target_text": "The IMDb rating on The jacket is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Thelma & louise?"
    },
    {
        "target_text": "The IMDb rating on Thelma & louise is 7.30."
    },
    {
        "input_text": "what was the rating on the movie There's something about mary?"
    },
    {
        "target_text": "The IMDb rating on There's something about mary is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Thirteen days?"
    },
    {
        "target_text": "The IMDb rating on Thirteen days is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Thunderheart?"
    },
    {
        "target_text": "The IMDb rating on Thunderheart is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Top gun?"
    },
    {
        "target_text": "The IMDb rating on Top gun is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Total recall?"
    },
    {
        "target_text": "The IMDb rating on Total recall is 7.40."
    },
    {
        "input_text": "what was the rating on the movie Tremors?"
    },
    {
        "target_text": "The IMDb rating on Tremors is 7.10."
    },
    {
        "input_text": "what was the rating on the movie True believer?"
    },
    {
        "target_text": "The IMDb rating on True believer is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Twin peaks: fire walk with me?"
    },
    {
        "target_text": "The IMDb rating on Twin peaks: fire walk with me is 7.00."
    },
    {
        "input_text": "what was the rating on the movie The verdict?"
    },
    {
        "target_text": "The IMDb rating on The verdict is 7.70."
    },
    {
        "input_text": "what was the rating on the movie The war of the worlds?"
    },
    {
        "target_text": "The IMDb rating on The war of the worlds is 7.10."
    },
    {
        "input_text": "what was the rating on the movie New nightmare?"
    },
    {
        "target_text": "The IMDb rating on New nightmare is 6.30."
    },
    {
        "input_text": "what was the rating on the movie White squall?"
    },
    {
        "target_text": "The IMDb rating on White squall is 6.40."
    },
    {
        "input_text": "what was the rating on the movie Wild at heart?"
    },
    {
        "target_text": "The IMDb rating on Wild at heart is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Wonder boys?"
    },
    {
        "target_text": "The IMDb rating on Wonder boys is 7.50."
    },
    {
        "input_text": "what was the rating on the movie The woodsman?"
    },
    {
        "target_text": "The IMDb rating on The woodsman is 7.40."
    },
    {
        "input_text": "what was the rating on the movie The abyss?"
    },
    {
        "target_text": "The IMDb rating on The abyss is 7.60."
    },
    {
        "input_text": "what was the rating on the movie L'avventura?"
    },
    {
        "target_text": "The IMDb rating on L'avventura is 7.90."
    },
    {
        "input_text": "what was the rating on the movie Agnes of god?"
    },
    {
        "target_text": "The IMDb rating on Agnes of god is 6.50."
    },
    {
        "input_text": "what was the rating on the movie A hard day's night?"
    },
    {
        "target_text": "The IMDb rating on A hard day's night is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Alien?"
    },
    {
        "target_text": "The IMDb rating on Alien is 8.50."
    },
    {
        "input_text": "what was the rating on the movie Alien vs. predator?"
    },
    {
        "target_text": "The IMDb rating on Alien vs. predator is 7.80."
    },
    {
        "input_text": "what was the rating on the movie All about eve?"
    },
    {
        "target_text": "The IMDb rating on All about eve is 8.50."
    },
    {
        "input_text": "what was the rating on the movie All the president's men?"
    },
    {
        "target_text": "The IMDb rating on All the president's men is 8.00."
    },
    {
        "input_text": "what was the rating on the movie American pie?"
    },
    {
        "target_text": "The IMDb rating on American pie is 6.90."
    },
    {
        "input_text": "what was the rating on the movie An american werewolf in paris?"
    },
    {
        "target_text": "The IMDb rating on An american werewolf in paris is 4.90."
    },
    {
        "input_text": "what was the rating on the movie Anastasia?"
    },
    {
        "target_text": "The IMDb rating on Anastasia is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Annie hall?"
    },
    {
        "target_text": "The IMDb rating on Annie hall is 8.30."
    },
    {
        "input_text": "what was the rating on the movie The anniversary party?"
    },
    {
        "target_text": "The IMDb rating on The anniversary party is 6.20."
    },
    {
        "input_text": "what was the rating on the movie Antz?"
    },
    {
        "target_text": "The IMDb rating on Antz is 6.80."
    },
    {
        "input_text": "what was the rating on the movie The apartment?"
    },
    {
        "target_text": "The IMDb rating on The apartment is 8.40."
    },
    {
        "input_text": "what was the rating on the movie Apocalypse now?"
    },
    {
        "target_text": "The IMDb rating on Apocalypse now is 8.60."
    },
    {
        "input_text": "what was the rating on the movie Arctic blue?"
    },
    {
        "target_text": "The IMDb rating on Arctic blue is 4.80."
    },
    {
        "input_text": "what was the rating on the movie As good as it gets?"
    },
    {
        "target_text": "The IMDb rating on As good as it gets is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Assassins?"
    },
    {
        "target_text": "The IMDb rating on Assassins is 6.00."
    },
    {
        "input_text": "what was the rating on the movie Asylum?"
    },
    {
        "target_text": "The IMDb rating on Asylum is 6.10."
    },
    {
        "input_text": "what was the rating on the movie A walk to remember?"
    },
    {
        "target_text": "The IMDb rating on A walk to remember is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Back to the future?"
    },
    {
        "target_text": "The IMDb rating on Back to the future is 8.40."
    },
    {
        "input_text": "what was the rating on the movie Badlands?"
    },
    {
        "target_text": "The IMDb rating on Badlands is 7.90."
    },
    {
        "input_text": "what was the rating on the movie The adventures of buckaroo banzai across the 8th dimension?"
    },
    {
        "target_text": "The IMDb rating on The adventures of buckaroo banzai across the 8th dimension is 6.00."
    },
    {
        "input_text": "what was the rating on the movie Barton fink?"
    },
    {
        "target_text": "The IMDb rating on Barton fink is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Basic instinct?"
    },
    {
        "target_text": "The IMDb rating on Basic instinct is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Basquiat?"
    },
    {
        "target_text": "The IMDb rating on Basquiat is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Batman returns?"
    },
    {
        "target_text": "The IMDb rating on Batman returns is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Batman and robin?"
    },
    {
        "target_text": "The IMDb rating on Batman and robin is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Batman forever?"
    },
    {
        "target_text": "The IMDb rating on Batman forever is 5.40."
    },
    {
        "input_text": "what was the rating on the movie Batman?"
    },
    {
        "target_text": "The IMDb rating on Batman is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Bean?"
    },
    {
        "target_text": "The IMDb rating on Bean is 5.80."
    },
    {
        "input_text": "what was the rating on the movie Beavis and butt-head do america?"
    },
    {
        "target_text": "The IMDb rating on Beavis and butt-head do america is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Beetle juice?"
    },
    {
        "target_text": "The IMDb rating on Beetle juice is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Being there?"
    },
    {
        "target_text": "The IMDb rating on Being there is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Being john malkovich?"
    },
    {
        "target_text": "The IMDb rating on Being john malkovich is 7.90."
    },
    {
        "input_text": "what was the rating on the movie Beloved?"
    },
    {
        "target_text": "The IMDb rating on Beloved is 5.60."
    },
    {
        "input_text": "what was the rating on the movie The big lebowski?"
    },
    {
        "target_text": "The IMDb rating on The big lebowski is 8.20."
    },
    {
        "input_text": "what was the rating on the movie The black dahlia?"
    },
    {
        "target_text": "The IMDb rating on The black dahlia is 5.60."
    },
    {
        "input_text": "what was the rating on the movie Blade ii?"
    },
    {
        "target_text": "The IMDb rating on Blade ii is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Blade?"
    },
    {
        "target_text": "The IMDb rating on Blade is 7.00."
    },
    {
        "input_text": "what was the rating on the movie Book of shadows: blair witch 2?"
    },
    {
        "target_text": "The IMDb rating on Book of shadows: blair witch 2 is 4.10."
    },
    {
        "input_text": "what was the rating on the movie Blood simple.?"
    },
    {
        "target_text": "The IMDb rating on Blood simple. is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Bloodmoon?"
    },
    {
        "target_text": "The IMDb rating on Bloodmoon is 4.50."
    },
    {
        "input_text": "what was the rating on the movie Blow?"
    },
    {
        "target_text": "The IMDb rating on Blow is 7.40."
    },
    {
        "input_text": "what was the rating on the movie La battaglia di algeri?"
    },
    {
        "target_text": "The IMDb rating on La battaglia di algeri is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Body of evidence?"
    },
    {
        "target_text": "The IMDb rating on Body of evidence is 4.10."
    },
    {
        "input_text": "what was the rating on the movie The bridges of madison county?"
    },
    {
        "target_text": "The IMDb rating on The bridges of madison county is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Bones?"
    },
    {
        "target_text": "The IMDb rating on Bones is 4.00."
    },
    {
        "input_text": "what was the rating on the movie Bound?"
    },
    {
        "target_text": "The IMDb rating on Bound is 7.50."
    },
    {
        "input_text": "what was the rating on the movie The bourne identity?"
    },
    {
        "target_text": "The IMDb rating on The bourne identity is 7.70."
    },
    {
        "input_text": "what was the rating on the movie Brazil?"
    },
    {
        "target_text": "The IMDb rating on Brazil is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Bringing out the dead?"
    },
    {
        "target_text": "The IMDb rating on Bringing out the dead is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Broadcast news?"
    },
    {
        "target_text": "The IMDb rating on Broadcast news is 7.10."
    },
    {
        "input_text": "what was the rating on the movie A bucket of blood?"
    },
    {
        "target_text": "The IMDb rating on A bucket of blood is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Buffy the vampire slayer?"
    },
    {
        "target_text": "The IMDb rating on Buffy the vampire slayer is 5.30."
    },
    {
        "input_text": "what was the rating on the movie Bull durham?"
    },
    {
        "target_text": "The IMDb rating on Bull durham is 7.00."
    },
    {
        "input_text": "what was the rating on the movie Casino?"
    },
    {
        "target_text": "The IMDb rating on Casino is 8.10."
    },
    {
        "input_text": "what was the rating on the movie Catwoman?"
    },
    {
        "target_text": "The IMDb rating on Catwoman is 3.20."
    },
    {
        "input_text": "what was the rating on the movie Cellular?"
    },
    {
        "target_text": "The IMDb rating on Cellular is 6.50."
    },
    {
        "input_text": "what was the rating on the movie The crying game?"
    },
    {
        "target_text": "The IMDb rating on The crying game is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Charade?"
    },
    {
        "target_text": "The IMDb rating on Charade is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Cherry falls?"
    },
    {
        "target_text": "The IMDb rating on Cherry falls is 4.80."
    },
    {
        "input_text": "what was the rating on the movie Chill factor?"
    },
    {
        "target_text": "The IMDb rating on Chill factor is 4.90."
    },
    {
        "input_text": "what was the rating on the movie Chinatown?"
    },
    {
        "target_text": "The IMDb rating on Chinatown is 8.50."
    },
    {
        "input_text": "what was the rating on the movie Nuovo cinema paradiso?"
    },
    {
        "target_text": "The IMDb rating on Nuovo cinema paradiso is 8.50."
    },
    {
        "input_text": "what was the rating on the movie Citizen kane?"
    },
    {
        "target_text": "The IMDb rating on Citizen kane is 8.60."
    },
    {
        "input_text": "what was the rating on the movie Clerks.?"
    },
    {
        "target_text": "The IMDb rating on Clerks. is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Cliffhanger?"
    },
    {
        "target_text": "The IMDb rating on Cliffhanger is 6.20."
    },
    {
        "input_text": "what was the rating on the movie A clockwork orange?"
    },
    {
        "target_text": "The IMDb rating on A clockwork orange is 8.50."
    },
    {
        "input_text": "what was the rating on the movie Collateral?"
    },
    {
        "target_text": "The IMDb rating on Collateral is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Conspiracy theory?"
    },
    {
        "target_text": "The IMDb rating on Conspiracy theory is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Contact?"
    },
    {
        "target_text": "The IMDb rating on Contact is 7.40."
    },
    {
        "input_text": "what was the rating on the movie Cool hand luke?"
    },
    {
        "target_text": "The IMDb rating on Cool hand luke is 8.30."
    },
    {
        "input_text": "what was the rating on the movie Copycat?"
    },
    {
        "target_text": "The IMDb rating on Copycat is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Crash?"
    },
    {
        "target_text": "The IMDb rating on Crash is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Crazy love?"
    },
    {
        "target_text": "The IMDb rating on Crazy love is 7.00."
    },
    {
        "input_text": "what was the rating on the movie Crime spree?"
    },
    {
        "target_text": "The IMDb rating on Crime spree is 6.40."
    },
    {
        "input_text": "what was the rating on the movie Crouching tiger, hidden dragon?"
    },
    {
        "target_text": "The IMDb rating on Crouching tiger, hidden dragon is 8.00."
    },
    {
        "input_text": "what was the rating on the movie The crow?"
    },
    {
        "target_text": "The IMDb rating on The crow is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Cruel intentions?"
    },
    {
        "target_text": "The IMDb rating on Cruel intentions is 6.70."
    },
    {
        "input_text": "what was the rating on the movie The curse of the cat people?"
    },
    {
        "target_text": "The IMDb rating on The curse of the cat people is 6.90."
    },
    {
        "input_text": "what was the rating on the movie The curse?"
    },
    {
        "target_text": "The IMDb rating on The curse is 4.50."
    },
    {
        "input_text": "what was the rating on the movie Dark city?"
    },
    {
        "target_text": "The IMDb rating on Dark city is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Dave?"
    },
    {
        "target_text": "The IMDb rating on Dave is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Day of the dead?"
    },
    {
        "target_text": "The IMDb rating on Day of the dead is 7.00."
    },
    {
        "input_text": "what was the rating on the movie Dead poets society?"
    },
    {
        "target_text": "The IMDb rating on Dead poets society is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Deep rising?"
    },
    {
        "target_text": "The IMDb rating on Deep rising is 5.70."
    },
    {
        "input_text": "what was the rating on the movie The deer hunter?"
    },
    {
        "target_text": "The IMDb rating on The deer hunter is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Demolition man?"
    },
    {
        "target_text": "The IMDb rating on Demolition man is 6.30."
    },
    {
        "input_text": "what was the rating on the movie The devil and daniel webster?"
    },
    {
        "target_text": "The IMDb rating on The devil and daniel webster is 5.70."
    },
    {
        "input_text": "what was the rating on the movie Die hard?"
    },
    {
        "target_text": "The IMDb rating on Die hard is 8.30."
    },
    {
        "input_text": "what was the rating on the movie Dog day afternoon?"
    },
    {
        "target_text": "The IMDb rating on Dog day afternoon is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Domino?"
    },
    {
        "target_text": "The IMDb rating on Domino is 5.90."
    },
    {
        "input_text": "what was the rating on the movie Do the right thing?"
    },
    {
        "target_text": "The IMDb rating on Do the right thing is 7.90."
    },
    {
        "input_text": "what was the rating on the movie Dumb and dumberer: when harry met lloyd?"
    },
    {
        "target_text": "The IMDb rating on Dumb and dumberer: when harry met lloyd is 3.30."
    },
    {
        "input_text": "what was the rating on the movie Dune?"
    },
    {
        "target_text": "The IMDb rating on Dune is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Ed wood?"
    },
    {
        "target_text": "The IMDb rating on Ed wood is 8.10."
    },
    {
        "input_text": "what was the rating on the movie Edtv?"
    },
    {
        "target_text": "The IMDb rating on Edtv is 6.10."
    },
    {
        "input_text": "what was the rating on the movie Election?"
    },
    {
        "target_text": "The IMDb rating on Election is 7.40."
    },
    {
        "input_text": "what was the rating on the movie L.a. confidential?"
    },
    {
        "target_text": "The IMDb rating on L.a. confidential is 8.40."
    },
    {
        "input_text": "what was the rating on the movie Enemy of the state?"
    },
    {
        "target_text": "The IMDb rating on Enemy of the state is 7.20."
    },
    {
        "input_text": "what was the rating on the movie The english patient?"
    },
    {
        "target_text": "The IMDb rating on The english patient is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Entrapment?"
    },
    {
        "target_text": "The IMDb rating on Entrapment is 6.10."
    },
    {
        "input_text": "what was the rating on the movie Erin brockovich?"
    },
    {
        "target_text": "The IMDb rating on Erin brockovich is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Star wars: the empire strikes back?"
    },
    {
        "target_text": "The IMDb rating on Star wars: the empire strikes back is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Escape from the planet of the apes?"
    },
    {
        "target_text": "The IMDb rating on Escape from the planet of the apes is 6.10."
    },
    {
        "input_text": "what was the rating on the movie Escape from l.a.?"
    },
    {
        "target_text": "The IMDb rating on Escape from l.a. is 5.30."
    },
    {
        "input_text": "what was the rating on the movie Excalibur?"
    },
    {
        "target_text": "The IMDb rating on Excalibur is 7.40."
    },
    {
        "input_text": "what was the rating on the movie The exorcist?"
    },
    {
        "target_text": "The IMDb rating on The exorcist is 8.10."
    },
    {
        "input_text": "what was the rating on the movie The fabulous baker boys?"
    },
    {
        "target_text": "The IMDb rating on The fabulous baker boys is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Face/off?"
    },
    {
        "target_text": "The IMDb rating on Face/off is 7.30."
    },
    {
        "input_text": "what was the rating on the movie The family man?"
    },
    {
        "target_text": "The IMDb rating on The family man is 6.60."
    },
    {
        "input_text": "what was the rating on the movie The fantastic four?"
    },
    {
        "target_text": "The IMDb rating on The fantastic four is 3.80."
    },
    {
        "input_text": "what was the rating on the movie Fantastic voyage?"
    },
    {
        "target_text": "The IMDb rating on Fantastic voyage is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Fargo?"
    },
    {
        "target_text": "The IMDb rating on Fargo is 8.30."
    },
    {
        "input_text": "what was the rating on the movie Fight club?"
    },
    {
        "target_text": "The IMDb rating on Fight club is 8.80."
    },
    {
        "input_text": "what was the rating on the movie Final destination 2?"
    },
    {
        "target_text": "The IMDb rating on Final destination 2 is 6.40."
    },
    {
        "input_text": "what was the rating on the movie Final destination?"
    },
    {
        "target_text": "The IMDb rating on Final destination is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Rambo: first blood part ii?"
    },
    {
        "target_text": "The IMDb rating on Rambo: first blood part ii is 5.80."
    },
    {
        "input_text": "what was the rating on the movie The fisher king?"
    },
    {
        "target_text": "The IMDb rating on The fisher king is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Five easy pieces?"
    },
    {
        "target_text": "The IMDb rating on Five easy pieces is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Five feet high and rising?"
    },
    {
        "target_text": "The IMDb rating on Five feet high and rising is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Fletch?"
    },
    {
        "target_text": "The IMDb rating on Fletch is 6.70."
    },
    {
        "input_text": "what was the rating on the movie The adventures of ford fairlane?"
    },
    {
        "target_text": "The IMDb rating on The adventures of ford fairlane is 5.60."
    },
    {
        "input_text": "what was the rating on the movie The french connection?"
    },
    {
        "target_text": "The IMDb rating on The french connection is 7.90."
    },
    {
        "input_text": "what was the rating on the movie Frequency?"
    },
    {
        "target_text": "The IMDb rating on Frequency is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Friday the 13th part iii?"
    },
    {
        "target_text": "The IMDb rating on Friday the 13th part iii is 5.10."
    },
    {
        "input_text": "what was the rating on the movie Jason lives: friday the 13th part vi?"
    },
    {
        "target_text": "The IMDb rating on Jason lives: friday the 13th part vi is 5.30."
    },
    {
        "input_text": "what was the rating on the movie Jason goes to hell: the final friday?"
    },
    {
        "target_text": "The IMDb rating on Jason goes to hell: the final friday is 4.10."
    },
    {
        "input_text": "what was the rating on the movie Friday the 13th part viii: jason takes manhattan?"
    },
    {
        "target_text": "The IMDb rating on Friday the 13th part viii: jason takes manhattan is 3.90."
    },
    {
        "input_text": "what was the rating on the movie Game 6?"
    },
    {
        "target_text": "The IMDb rating on Game 6 is 6.00."
    },
    {
        "input_text": "what was the rating on the movie Gandhi?"
    },
    {
        "target_text": "The IMDb rating on Gandhi is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Gattaca?"
    },
    {
        "target_text": "The IMDb rating on Gattaca is 7.80."
    },
    {
        "input_text": "what was the rating on the movie The getaway?"
    },
    {
        "target_text": "The IMDb rating on The getaway is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Get carter?"
    },
    {
        "target_text": "The IMDb rating on Get carter is 4.80."
    },
    {
        "input_text": "what was the rating on the movie Glengarry glen ross?"
    },
    {
        "target_text": "The IMDb rating on Glengarry glen ross is 7.90."
    },
    {
        "input_text": "what was the rating on the movie The godfather: part ii?"
    },
    {
        "target_text": "The IMDb rating on The godfather: part ii is 9.00."
    },
    {
        "input_text": "what was the rating on the movie Gods and monsters?"
    },
    {
        "target_text": "The IMDb rating on Gods and monsters is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Gone in sixty seconds?"
    },
    {
        "target_text": "The IMDb rating on Gone in sixty seconds is 6.00."
    },
    {
        "input_text": "what was the rating on the movie Goodfellas?"
    },
    {
        "target_text": "The IMDb rating on Goodfellas is 8.80."
    },
    {
        "input_text": "what was the rating on the movie Good will hunting?"
    },
    {
        "target_text": "The IMDb rating on Good will hunting is 8.10."
    },
    {
        "input_text": "what was the rating on the movie The grapes of wrath?"
    },
    {
        "target_text": "The IMDb rating on The grapes of wrath is 8.30."
    },
    {
        "input_text": "what was the rating on the movie Grosse pointe blank?"
    },
    {
        "target_text": "The IMDb rating on Grosse pointe blank is 7.40."
    },
    {
        "input_text": "what was the rating on the movie The horse whisperer?"
    },
    {
        "target_text": "The IMDb rating on The horse whisperer is 6.40."
    },
    {
        "input_text": "what was the rating on the movie Hackers?"
    },
    {
        "target_text": "The IMDb rating on Hackers is 5.80."
    },
    {
        "input_text": "what was the rating on the movie Halloween 4: the return of michael myers?"
    },
    {
        "target_text": "The IMDb rating on Halloween 4: the return of michael myers is 5.60."
    },
    {
        "input_text": "what was the rating on the movie Halloween?"
    },
    {
        "target_text": "The IMDb rating on Halloween is 7.90."
    },
    {
        "input_text": "what was the rating on the movie Hannah and her sisters?"
    },
    {
        "target_text": "The IMDb rating on Hannah and her sisters is 7.90."
    },
    {
        "input_text": "what was the rating on the movie Hannibal?"
    },
    {
        "target_text": "The IMDb rating on Hannibal is 6.40."
    },
    {
        "input_text": "what was the rating on the movie Happy campers?"
    },
    {
        "target_text": "The IMDb rating on Happy campers is 5.40."
    },
    {
        "input_text": "what was the rating on the movie Heathers?"
    },
    {
        "target_text": "The IMDb rating on Heathers is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Heavenly creatures?"
    },
    {
        "target_text": "The IMDb rating on Heavenly creatures is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Hellraiser: hellseeker?"
    },
    {
        "target_text": "The IMDb rating on Hellraiser: hellseeker is 4.90."
    },
    {
        "input_text": "what was the rating on the movie Hero?"
    },
    {
        "target_text": "The IMDb rating on Hero is 6.30."
    },
    {
        "input_text": "what was the rating on the movie Hider in the house?"
    },
    {
        "target_text": "The IMDb rating on Hider in the house is 5.60."
    },
    {
        "input_text": "what was the rating on the movie Highlander iii: the sorcerer?"
    },
    {
        "target_text": "The IMDb rating on Highlander iii: the sorcerer is 3.90."
    },
    {
        "input_text": "what was the rating on the movie Hostage?"
    },
    {
        "target_text": "The IMDb rating on Hostage is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Hotel rwanda?"
    },
    {
        "target_text": "The IMDb rating on Hotel rwanda is 8.30."
    },
    {
        "input_text": "what was the rating on the movie House on haunted hill?"
    },
    {
        "target_text": "The IMDb rating on House on haunted hill is 5.30."
    },
    {
        "input_text": "what was the rating on the movie House of the damned?"
    },
    {
        "target_text": "The IMDb rating on House of the damned is 4.30."
    },
    {
        "input_text": "what was the rating on the movie Hellraiser iii: hell on earth?"
    },
    {
        "target_text": "The IMDb rating on Hellraiser iii: hell on earth is 5.10."
    },
    {
        "input_text": "what was the rating on the movie Hudson hawk?"
    },
    {
        "target_text": "The IMDb rating on Hudson hawk is 5.40."
    },
    {
        "input_text": "what was the rating on the movie The hudsucker proxy?"
    },
    {
        "target_text": "The IMDb rating on The hudsucker proxy is 7.40."
    },
    {
        "input_text": "what was the rating on the movie I walked with a zombie?"
    },
    {
        "target_text": "The IMDb rating on I walked with a zombie is 7.30."
    },
    {
        "input_text": "what was the rating on the movie The ice storm?"
    },
    {
        "target_text": "The IMDb rating on The ice storm is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Insomnia?"
    },
    {
        "target_text": "The IMDb rating on Insomnia is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Interview with the vampire: the vampire chronicles?"
    },
    {
        "target_text": "The IMDb rating on Interview with the vampire: the vampire chronicles is 7.40."
    },
    {
        "input_text": "what was the rating on the movie I still know what you did last summer?"
    },
    {
        "target_text": "The IMDb rating on I still know what you did last summer is 4.10."
    },
    {
        "input_text": "what was the rating on the movie Isle of the dead?"
    },
    {
        "target_text": "The IMDb rating on Isle of the dead is 6.60."
    },
    {
        "input_text": "what was the rating on the movie It's a wonderful life?"
    },
    {
        "target_text": "The IMDb rating on It's a wonderful life is 8.70."
    },
    {
        "input_text": "what was the rating on the movie Jaws 2?"
    },
    {
        "target_text": "The IMDb rating on Jaws 2 is 5.60."
    },
    {
        "input_text": "what was the rating on the movie Jaws 3-d?"
    },
    {
        "target_text": "The IMDb rating on Jaws 3-d is 3.30."
    },
    {
        "input_text": "what was the rating on the movie Jaws: the revenge?"
    },
    {
        "target_text": "The IMDb rating on Jaws: the revenge is 2.60."
    },
    {
        "input_text": "what was the rating on the movie The jazz singer?"
    },
    {
        "target_text": "The IMDb rating on The jazz singer is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Jennifer eight?"
    },
    {
        "target_text": "The IMDb rating on Jennifer eight is 6.20."
    },
    {
        "input_text": "what was the rating on the movie Jerry maguire?"
    },
    {
        "target_text": "The IMDb rating on Jerry maguire is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Jurassic park iii?"
    },
    {
        "target_text": "The IMDb rating on Jurassic park iii is 5.70."
    },
    {
        "input_text": "what was the rating on the movie The lost world: jurassic park?"
    },
    {
        "target_text": "The IMDb rating on The lost world: jurassic park is 6.00."
    },
    {
        "input_text": "what was the rating on the movie Jurassic park?"
    },
    {
        "target_text": "The IMDb rating on Jurassic park is 7.90."
    },
    {
        "input_text": "what was the rating on the movie Freddy vs. jason?"
    },
    {
        "target_text": "The IMDb rating on Freddy vs. jason is 5.80."
    },
    {
        "input_text": "what was the rating on the movie Kafka?"
    },
    {
        "target_text": "The IMDb rating on Kafka is 6.90."
    },
    {
        "input_text": "what was the rating on the movie King kong?"
    },
    {
        "target_text": "The IMDb rating on King kong is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Klute?"
    },
    {
        "target_text": "The IMDb rating on Klute is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Kramer vs. kramer?"
    },
    {
        "target_text": "The IMDb rating on Kramer vs. kramer is 7.70."
    },
    {
        "input_text": "what was the rating on the movie Kundun?"
    },
    {
        "target_text": "The IMDb rating on Kundun is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Lake placid?"
    },
    {
        "target_text": "The IMDb rating on Lake placid is 5.40."
    },
    {
        "input_text": "what was the rating on the movie The silence of the lambs?"
    },
    {
        "target_text": "The IMDb rating on The silence of the lambs is 8.70."
    },
    {
        "input_text": "what was the rating on the movie Last of the mohicans?"
    },
    {
        "target_text": "The IMDb rating on Last of the mohicans is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Leviathan?"
    },
    {
        "target_text": "The IMDb rating on Leviathan is 5.30."
    },
    {
        "input_text": "what was the rating on the movie Lock, stock and two smoking barrels?"
    },
    {
        "target_text": "The IMDb rating on Lock, stock and two smoking barrels is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Lone star?"
    },
    {
        "target_text": "The IMDb rating on Lone star is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Lord of illusions?"
    },
    {
        "target_text": "The IMDb rating on Lord of illusions is 5.60."
    },
    {
        "input_text": "what was the rating on the movie Lost in translation?"
    },
    {
        "target_text": "The IMDb rating on Lost in translation is 7.90."
    },
    {
        "input_text": "what was the rating on the movie Lost souls?"
    },
    {
        "target_text": "The IMDb rating on Lost souls is 4.60."
    },
    {
        "input_text": "what was the rating on the movie Love & basketball?"
    },
    {
        "target_text": "The IMDb rating on Love & basketball is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Magnolia?"
    },
    {
        "target_text": "The IMDb rating on Magnolia is 8.00."
    },
    {
        "input_text": "what was the rating on the movie The man in the iron mask?"
    },
    {
        "target_text": "The IMDb rating on The man in the iron mask is 6.10."
    },
    {
        "input_text": "what was the rating on the movie Manhunt?"
    },
    {
        "target_text": "The IMDb rating on Manhunt is 8.70."
    },
    {
        "input_text": "what was the rating on the movie Manhunter?"
    },
    {
        "target_text": "The IMDb rating on Manhunter is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Man on the moon?"
    },
    {
        "target_text": "The IMDb rating on Man on the moon is 7.40."
    },
    {
        "input_text": "what was the rating on the movie The matrix?"
    },
    {
        "target_text": "The IMDb rating on The matrix is 8.70."
    },
    {
        "input_text": "what was the rating on the movie Halloween iii: season of the witch?"
    },
    {
        "target_text": "The IMDb rating on Halloween iii: season of the witch is 3.80."
    },
    {
        "input_text": "what was the rating on the movie Meet joe black?"
    },
    {
        "target_text": "The IMDb rating on Meet joe black is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Memento?"
    },
    {
        "target_text": "The IMDb rating on Memento is 8.70."
    },
    {
        "input_text": "what was the rating on the movie Miami vice?"
    },
    {
        "target_text": "The IMDb rating on Miami vice is 6.00."
    },
    {
        "input_text": "what was the rating on the movie Midnight cowboy?"
    },
    {
        "target_text": "The IMDb rating on Midnight cowboy is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Midnight express?"
    },
    {
        "target_text": "The IMDb rating on Midnight express is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Mimic?"
    },
    {
        "target_text": "The IMDb rating on Mimic is 5.70."
    },
    {
        "input_text": "what was the rating on the movie Misery?"
    },
    {
        "target_text": "The IMDb rating on Misery is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Mission: impossible ii?"
    },
    {
        "target_text": "The IMDb rating on Mission: impossible ii is 5.70."
    },
    {
        "input_text": "what was the rating on the movie Mission: impossible?"
    },
    {
        "target_text": "The IMDb rating on Mission: impossible is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Moonstruck?"
    },
    {
        "target_text": "The IMDb rating on Moonstruck is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Monty python and the holy grail?"
    },
    {
        "target_text": "The IMDb rating on Monty python and the holy grail is 8.40."
    },
    {
        "input_text": "what was the rating on the movie Mrs brown?"
    },
    {
        "target_text": "The IMDb rating on Mrs brown is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Arcade?"
    },
    {
        "target_text": "The IMDb rating on Arcade is 4.60."
    },
    {
        "input_text": "what was the rating on the movie Mulholland dr.?"
    },
    {
        "target_text": "The IMDb rating on Mulholland dr. is 8.00."
    },
    {
        "input_text": "what was the rating on the movie \"murderland\"?"
    },
    {
        "target_text": "The IMDb rating on \"murderland\" is 5.80."
    },
    {
        "input_text": "what was the rating on the movie My girl 2?"
    },
    {
        "target_text": "The IMDb rating on My girl 2 is 4.80."
    },
    {
        "input_text": "what was the rating on the movie My girl?"
    },
    {
        "target_text": "The IMDb rating on My girl is 6.40."
    },
    {
        "input_text": "what was the rating on the movie My best friend's wedding?"
    },
    {
        "target_text": "The IMDb rating on My best friend's wedding is 6.20."
    },
    {
        "input_text": "what was the rating on the movie Nashville?"
    },
    {
        "target_text": "The IMDb rating on Nashville is 7.70."
    },
    {
        "input_text": "what was the rating on the movie Natural born killers?"
    },
    {
        "target_text": "The IMDb rating on Natural born killers is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Nothing but a man?"
    },
    {
        "target_text": "The IMDb rating on Nothing but a man is 7.80."
    },
    {
        "input_text": "what was the rating on the movie The negotiator?"
    },
    {
        "target_text": "The IMDb rating on The negotiator is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Neuromancer?"
    },
    {
        "target_text": "The IMDb rating on Neuromancer is 9.30."
    },
    {
        "input_text": "what was the rating on the movie Never been kissed?"
    },
    {
        "target_text": "The IMDb rating on Never been kissed is 5.70."
    },
    {
        "input_text": "what was the rating on the movie The nightmare before christmas?"
    },
    {
        "target_text": "The IMDb rating on The nightmare before christmas is 8.00."
    },
    {
        "input_text": "what was the rating on the movie A nightmare on elm street part 2: freddy's revenge?"
    },
    {
        "target_text": "The IMDb rating on A nightmare on elm street part 2: freddy's revenge is 4.90."
    },
    {
        "input_text": "what was the rating on the movie A nightmare on elm street 3: dream warriors?"
    },
    {
        "target_text": "The IMDb rating on A nightmare on elm street 3: dream warriors is 6.30."
    },
    {
        "input_text": "what was the rating on the movie Notting hill?"
    },
    {
        "target_text": "The IMDb rating on Notting hill is 6.90."
    },
    {
        "input_text": "what was the rating on the movie One flew over the cuckoo's nest?"
    },
    {
        "target_text": "The IMDb rating on One flew over the cuckoo's nest is 8.90."
    },
    {
        "input_text": "what was the rating on the movie Only you?"
    },
    {
        "target_text": "The IMDb rating on Only you is 6.20."
    },
    {
        "input_text": "what was the rating on the movie On the waterfront?"
    },
    {
        "target_text": "The IMDb rating on On the waterfront is 8.40."
    },
    {
        "input_text": "what was the rating on the movie Orgy of the dead?"
    },
    {
        "target_text": "The IMDb rating on Orgy of the dead is 2.50."
    },
    {
        "input_text": "what was the rating on the movie Out of sight?"
    },
    {
        "target_text": "The IMDb rating on Out of sight is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Pearl harbor?"
    },
    {
        "target_text": "The IMDb rating on Pearl harbor is 5.40."
    },
    {
        "input_text": "what was the rating on the movie Peggy sue got married?"
    },
    {
        "target_text": "The IMDb rating on Peggy sue got married is 6.30."
    },
    {
        "input_text": "what was the rating on the movie Pet sematary ii?"
    },
    {
        "target_text": "The IMDb rating on Pet sematary ii is 4.20."
    },
    {
        "input_text": "what was the rating on the movie Philadelphia?"
    },
    {
        "target_text": "The IMDb rating on Philadelphia is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Pitch black?"
    },
    {
        "target_text": "The IMDb rating on Pitch black is 7.00."
    },
    {
        "input_text": "what was the rating on the movie Planet of the apes?"
    },
    {
        "target_text": "The IMDb rating on Planet of the apes is 5.50."
    },
    {
        "input_text": "what was the rating on the movie Platoon?"
    },
    {
        "target_text": "The IMDb rating on Platoon is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Playback?"
    },
    {
        "target_text": "The IMDb rating on Playback is 3.60."
    },
    {
        "input_text": "what was the rating on the movie The ploughman's lunch?"
    },
    {
        "target_text": "The IMDb rating on The ploughman's lunch is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Point break?"
    },
    {
        "target_text": "The IMDb rating on Point break is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Predator?"
    },
    {
        "target_text": "The IMDb rating on Predator is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Pretty woman?"
    },
    {
        "target_text": "The IMDb rating on Pretty woman is 6.70."
    },
    {
        "input_text": "what was the rating on the movie The princess bride?"
    },
    {
        "target_text": "The IMDb rating on The princess bride is 8.10."
    },
    {
        "input_text": "what was the rating on the movie The producers?"
    },
    {
        "target_text": "The IMDb rating on The producers is 7.70."
    },
    {
        "input_text": "what was the rating on the movie Psycho?"
    },
    {
        "target_text": "The IMDb rating on Psycho is 8.70."
    },
    {
        "input_text": "what was the rating on the movie Maniac?"
    },
    {
        "target_text": "The IMDb rating on Maniac is 6.20."
    },
    {
        "input_text": "what was the rating on the movie Vampyr?"
    },
    {
        "target_text": "The IMDb rating on Vampyr is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Mystery of the wax museum?"
    },
    {
        "target_text": "The IMDb rating on Mystery of the wax museum is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Quantum project?"
    },
    {
        "target_text": "The IMDb rating on Quantum project is 4.80."
    },
    {
        "input_text": "what was the rating on the movie Rambling rose?"
    },
    {
        "target_text": "The IMDb rating on Rambling rose is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Red white black & blue?"
    },
    {
        "target_text": "The IMDb rating on Red white black & blue is 6.30."
    },
    {
        "input_text": "what was the rating on the movie Star wars: episode vi - return of the jedi?"
    },
    {
        "target_text": "The IMDb rating on Star wars: episode vi - return of the jedi is 8.30."
    },
    {
        "input_text": "what was the rating on the movie The rocky horror picture show?"
    },
    {
        "target_text": "The IMDb rating on The rocky horror picture show is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Rocky?"
    },
    {
        "target_text": "The IMDb rating on Rocky is 8.10."
    },
    {
        "input_text": "what was the rating on the movie Who framed roger rabbit?"
    },
    {
        "target_text": "The IMDb rating on Who framed roger rabbit is 7.60."
    },
    {
        "input_text": "what was the rating on the movie Romeo and juliet?"
    },
    {
        "target_text": "The IMDb rating on Romeo and juliet is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Ronin?"
    },
    {
        "target_text": "The IMDb rating on Ronin is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Route 9?"
    },
    {
        "target_text": "The IMDb rating on Route 9 is 6.00."
    },
    {
        "input_text": "what was the rating on the movie Rush hour 2?"
    },
    {
        "target_text": "The IMDb rating on Rush hour 2 is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Rush hour?"
    },
    {
        "target_text": "The IMDb rating on Rush hour is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Runaway bride?"
    },
    {
        "target_text": "The IMDb rating on Runaway bride is 5.20."
    },
    {
        "input_text": "what was the rating on the movie Sleepless in seattle?"
    },
    {
        "target_text": "The IMDb rating on Sleepless in seattle is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Salt of the earth?"
    },
    {
        "target_text": "The IMDb rating on Salt of the earth is 7.60."
    },
    {
        "input_text": "what was the rating on the movie The salton sea?"
    },
    {
        "target_text": "The IMDb rating on The salton sea is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Saving private ryan?"
    },
    {
        "target_text": "The IMDb rating on Saving private ryan is 8.50."
    },
    {
        "input_text": "what was the rating on the movie Say anything...?"
    },
    {
        "target_text": "The IMDb rating on Say anything... is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Schindler's list?"
    },
    {
        "target_text": "The IMDb rating on Schindler's list is 8.90."
    },
    {
        "input_text": "what was the rating on the movie Scream 2?"
    },
    {
        "target_text": "The IMDb rating on Scream 2 is 5.90."
    },
    {
        "input_text": "what was the rating on the movie Scream 3?"
    },
    {
        "target_text": "The IMDb rating on Scream 3 is 5.30."
    },
    {
        "input_text": "what was the rating on the movie Scream?"
    },
    {
        "target_text": "The IMDb rating on Scream is 7.20."
    },
    {
        "input_text": "what was the rating on the movie Seven?"
    },
    {
        "target_text": "The IMDb rating on Seven is 6.10."
    },
    {
        "input_text": "what was the rating on the movie The searchers?"
    },
    {
        "target_text": "The IMDb rating on The searchers is 8.10."
    },
    {
        "input_text": "what was the rating on the movie Seven days to live?"
    },
    {
        "target_text": "The IMDb rating on Seven days to live is 5.20."
    },
    {
        "input_text": "what was the rating on the movie Shakespeare in love?"
    },
    {
        "target_text": "The IMDb rating on Shakespeare in love is 7.40."
    },
    {
        "input_text": "what was the rating on the movie Shallow grave?"
    },
    {
        "target_text": "The IMDb rating on Shallow grave is 7.40."
    },
    {
        "input_text": "what was the rating on the movie Shampoo?"
    },
    {
        "target_text": "The IMDb rating on Shampoo is 6.20."
    },
    {
        "input_text": "what was the rating on the movie The shining?"
    },
    {
        "target_text": "The IMDb rating on The shining is 8.50."
    },
    {
        "input_text": "what was the rating on the movie Silver bullet?"
    },
    {
        "target_text": "The IMDb rating on Silver bullet is 5.90."
    },
    {
        "input_text": "what was the rating on the movie Sister act?"
    },
    {
        "target_text": "The IMDb rating on Sister act is 5.90."
    },
    {
        "input_text": "what was the rating on the movie Sleepy hollow?"
    },
    {
        "target_text": "The IMDb rating on Sleepy hollow is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Sling blade?"
    },
    {
        "target_text": "The IMDb rating on Sling blade is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Smoke?"
    },
    {
        "target_text": "The IMDb rating on Smoke is 7.50."
    },
    {
        "input_text": "what was the rating on the movie Snow falling on cedars?"
    },
    {
        "target_text": "The IMDb rating on Snow falling on cedars is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Soldier?"
    },
    {
        "target_text": "The IMDb rating on Soldier is 5.60."
    },
    {
        "input_text": "what was the rating on the movie Some like it hot?"
    },
    {
        "target_text": "The IMDb rating on Some like it hot is 8.40."
    },
    {
        "input_text": "what was the rating on the movie The wedding date?"
    },
    {
        "target_text": "The IMDb rating on The wedding date is 5.50."
    },
    {
        "input_text": "what was the rating on the movie Sounder?"
    },
    {
        "target_text": "The IMDb rating on Sounder is 7.80."
    },
    {
        "input_text": "what was the rating on the movie South park: bigger longer & uncut?"
    },
    {
        "target_text": "The IMDb rating on South park: bigger longer & uncut is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Spacejacked?"
    },
    {
        "target_text": "The IMDb rating on Spacejacked is 2.90."
    },
    {
        "input_text": "what was the rating on the movie Spare me?"
    },
    {
        "target_text": "The IMDb rating on Spare me is 5.80."
    },
    {
        "input_text": "what was the rating on the movie Sphere?"
    },
    {
        "target_text": "The IMDb rating on Sphere is 5.60."
    },
    {
        "input_text": "what was the rating on the movie Star wars?"
    },
    {
        "target_text": "The IMDb rating on Star wars is 8.80."
    },
    {
        "input_text": "what was the rating on the movie Starship troopers?"
    },
    {
        "target_text": "The IMDb rating on Starship troopers is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Star trek: the motion picture?"
    },
    {
        "target_text": "The IMDb rating on Star trek: the motion picture is 6.20."
    },
    {
        "input_text": "what was the rating on the movie State and main?"
    },
    {
        "target_text": "The IMDb rating on State and main is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Stepmom?"
    },
    {
        "target_text": "The IMDb rating on Stepmom is 6.20."
    },
    {
        "input_text": "what was the rating on the movie Storytelling?"
    },
    {
        "target_text": "The IMDb rating on Storytelling is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Stranglehold?"
    },
    {
        "target_text": "The IMDb rating on Stranglehold is 8.60."
    },
    {
        "input_text": "what was the rating on the movie Dr. strangelove or: how i learned to stop worrying and love the bomb?"
    },
    {
        "target_text": "The IMDb rating on Dr. strangelove or: how i learned to stop worrying and love the bomb is 8.60."
    },
    {
        "input_text": "what was the rating on the movie Suburbia?"
    },
    {
        "target_text": "The IMDb rating on Suburbia is 6.50."
    },
    {
        "input_text": "what was the rating on the movie Sugar & spice?"
    },
    {
        "target_text": "The IMDb rating on Sugar & spice is 5.20."
    },
    {
        "input_text": "what was the rating on the movie Sunset blvd.?"
    },
    {
        "target_text": "The IMDb rating on Sunset blvd. is 8.70."
    },
    {
        "input_text": "what was the rating on the movie Supergirl?"
    },
    {
        "target_text": "The IMDb rating on Supergirl is 4.10."
    },
    {
        "input_text": "what was the rating on the movie Superman iii?"
    },
    {
        "target_text": "The IMDb rating on Superman iii is 4.70."
    },
    {
        "input_text": "what was the rating on the movie Superman ii?"
    },
    {
        "target_text": "The IMDb rating on Superman ii is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Superman iv: the quest for peace?"
    },
    {
        "target_text": "The IMDb rating on Superman iv: the quest for peace is 3.40."
    },
    {
        "input_text": "what was the rating on the movie Superman?"
    },
    {
        "target_text": "The IMDb rating on Superman is 7.30."
    },
    {
        "input_text": "what was the rating on the movie The sweet hereafter?"
    },
    {
        "target_text": "The IMDb rating on The sweet hereafter is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Sweet smell of success?"
    },
    {
        "target_text": "The IMDb rating on Sweet smell of success is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Terminator 2: judgment day?"
    },
    {
        "target_text": "The IMDb rating on Terminator 2: judgment day is 8.50."
    },
    {
        "input_text": "what was the rating on the movie Taking sides?"
    },
    {
        "target_text": "The IMDb rating on Taking sides is 7.20."
    },
    {
        "input_text": "what was the rating on the movie The terminator?"
    },
    {
        "target_text": "The IMDb rating on The terminator is 8.10."
    },
    {
        "input_text": "what was the rating on the movie The game?"
    },
    {
        "target_text": "The IMDb rating on The game is 7.70."
    },
    {
        "input_text": "what was the rating on the movie The haunting?"
    },
    {
        "target_text": "The IMDb rating on The haunting is 4.60."
    },
    {
        "input_text": "what was the rating on the movie The limey?"
    },
    {
        "target_text": "The IMDb rating on The limey is 7.00."
    },
    {
        "input_text": "what was the rating on the movie The man who wasn't there?"
    },
    {
        "target_text": "The IMDb rating on The man who wasn't there is 7.70."
    },
    {
        "input_text": "what was the rating on the movie The relic?"
    },
    {
        "target_text": "The IMDb rating on The relic is 5.40."
    },
    {
        "input_text": "what was the rating on the movie The truman show?"
    },
    {
        "target_text": "The IMDb rating on The truman show is 8.00."
    },
    {
        "input_text": "what was the rating on the movie The x files?"
    },
    {
        "target_text": "The IMDb rating on The x files is 6.80."
    },
    {
        "input_text": "what was the rating on the movie The cell?"
    },
    {
        "target_text": "The IMDb rating on The cell is 6.20."
    },
    {
        "input_text": "what was the rating on the movie The third man?"
    },
    {
        "target_text": "The IMDb rating on The third man is 8.50."
    },
    {
        "input_text": "what was the rating on the movie The beach?"
    },
    {
        "target_text": "The IMDb rating on The beach is 6.30."
    },
    {
        "input_text": "what was the rating on the movie The believer?"
    },
    {
        "target_text": "The IMDb rating on The believer is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Le grand bleu?"
    },
    {
        "target_text": "The IMDb rating on Le grand bleu is 7.40."
    },
    {
        "input_text": "what was the rating on the movie The hebrew hammer?"
    },
    {
        "target_text": "The IMDb rating on The hebrew hammer is 6.20."
    },
    {
        "input_text": "what was the rating on the movie The leopard man?"
    },
    {
        "target_text": "The IMDb rating on The leopard man is 6.90."
    },
    {
        "input_text": "what was the rating on the movie The lost son?"
    },
    {
        "target_text": "The IMDb rating on The lost son is 6.50."
    },
    {
        "input_text": "what was the rating on the movie The messenger?"
    },
    {
        "target_text": "The IMDb rating on The messenger is 7.40."
    },
    {
        "input_text": "what was the rating on the movie The pianist?"
    },
    {
        "target_text": "The IMDb rating on The pianist is 8.50."
    },
    {
        "input_text": "what was the rating on the movie The piano?"
    },
    {
        "target_text": "The IMDb rating on The piano is 7.50."
    },
    {
        "input_text": "what was the rating on the movie The sting?"
    },
    {
        "target_text": "The IMDb rating on The sting is 8.40."
    },
    {
        "input_text": "what was the rating on the movie The thin man?"
    },
    {
        "target_text": "The IMDb rating on The thin man is 8.10."
    },
    {
        "input_text": "what was the rating on the movie Three kings?"
    },
    {
        "target_text": "The IMDb rating on Three kings is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Thx 1138?"
    },
    {
        "target_text": "The IMDb rating on Thx 1138 is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Ticker?"
    },
    {
        "target_text": "The IMDb rating on Ticker is 3.30."
    },
    {
        "input_text": "what was the rating on the movie Trouble in paradise?"
    },
    {
        "target_text": "The IMDb rating on Trouble in paradise is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Titanic?"
    },
    {
        "target_text": "The IMDb rating on Titanic is 7.40."
    },
    {
        "input_text": "what was the rating on the movie Transatlantic merry-go-round?"
    },
    {
        "target_text": "The IMDb rating on Transatlantic merry-go-round is 6.90."
    },
    {
        "input_text": "what was the rating on the movie Tombstone?"
    },
    {
        "target_text": "The IMDb rating on Tombstone is 7.70."
    },
    {
        "input_text": "what was the rating on the movie Tomorrow never dies?"
    },
    {
        "target_text": "The IMDb rating on Tomorrow never dies is 6.40."
    },
    {
        "input_text": "what was the rating on the movie To sleep with anger?"
    },
    {
        "target_text": "The IMDb rating on To sleep with anger is 6.80."
    },
    {
        "input_text": "what was the rating on the movie Toy story?"
    },
    {
        "target_text": "The IMDb rating on Toy story is 8.20."
    },
    {
        "input_text": "what was the rating on the movie The magic toyshop?"
    },
    {
        "target_text": "The IMDb rating on The magic toyshop is 6.20."
    },
    {
        "input_text": "what was the rating on the movie Traffic?"
    },
    {
        "target_text": "The IMDb rating on Traffic is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Trainspotting?"
    },
    {
        "target_text": "The IMDb rating on Trainspotting is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Star trek v: the final frontier?"
    },
    {
        "target_text": "The IMDb rating on Star trek v: the final frontier is 5.00."
    },
    {
        "input_text": "what was the rating on the movie Tron?"
    },
    {
        "target_text": "The IMDb rating on Tron is 6.70."
    },
    {
        "input_text": "what was the rating on the movie True lies?"
    },
    {
        "target_text": "The IMDb rating on True lies is 7.20."
    },
    {
        "input_text": "what was the rating on the movie True romance?"
    },
    {
        "target_text": "The IMDb rating on True romance is 7.90."
    },
    {
        "input_text": "what was the rating on the movie Twelve monkeys?"
    },
    {
        "target_text": "The IMDb rating on Twelve monkeys is 8.10."
    },
    {
        "input_text": "what was the rating on the movie U-turn?"
    },
    {
        "target_text": "The IMDb rating on U-turn is 5.80."
    },
    {
        "input_text": "what was the rating on the movie U turn?"
    },
    {
        "target_text": "The IMDb rating on U turn is 6.70."
    },
    {
        "input_text": "what was the rating on the movie Unbreakable?"
    },
    {
        "target_text": "The IMDb rating on Unbreakable is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Unforgiven?"
    },
    {
        "target_text": "The IMDb rating on Unforgiven is 8.30."
    },
    {
        "input_text": "what was the rating on the movie The usual suspects?"
    },
    {
        "target_text": "The IMDb rating on The usual suspects is 8.70."
    },
    {
        "input_text": "what was the rating on the movie Verdict?"
    },
    {
        "target_text": "The IMDb rating on Verdict is 5.70."
    },
    {
        "input_text": "what was the rating on the movie Vertigo?"
    },
    {
        "target_text": "The IMDb rating on Vertigo is 8.60."
    },
    {
        "input_text": "what was the rating on the movie Very bad things?"
    },
    {
        "target_text": "The IMDb rating on Very bad things is 6.00."
    },
    {
        "input_text": "what was the rating on the movie Viridiana?"
    },
    {
        "target_text": "The IMDb rating on Viridiana is 8.20."
    },
    {
        "input_text": "what was the rating on the movie Virtuosity?"
    },
    {
        "target_text": "The IMDb rating on Virtuosity is 5.30."
    },
    {
        "input_text": "what was the rating on the movie Wag the dog?"
    },
    {
        "target_text": "The IMDb rating on Wag the dog is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Wall street?"
    },
    {
        "target_text": "The IMDb rating on Wall street is 7.30."
    },
    {
        "input_text": "what was the rating on the movie Waxwork?"
    },
    {
        "target_text": "The IMDb rating on Waxwork is 6.00."
    },
    {
        "input_text": "what was the rating on the movie What lies beneath?"
    },
    {
        "target_text": "The IMDb rating on What lies beneath is 6.50."
    },
    {
        "input_text": "what was the rating on the movie What women want?"
    },
    {
        "target_text": "The IMDb rating on What women want is 6.30."
    },
    {
        "input_text": "what was the rating on the movie The witching hour?"
    },
    {
        "target_text": "The IMDb rating on The witching hour is 6.50."
    },
    {
        "input_text": "what was the rating on the movie White angel?"
    },
    {
        "target_text": "The IMDb rating on White angel is 4.40."
    },
    {
        "input_text": "what was the rating on the movie Who's your daddy??"
    },
    {
        "target_text": "The IMDb rating on Who's your daddy? is 4.50."
    },
    {
        "input_text": "what was the rating on the movie Wild things?"
    },
    {
        "target_text": "The IMDb rating on Wild things is 6.60."
    },
    {
        "input_text": "what was the rating on the movie Wild wild west?"
    },
    {
        "target_text": "The IMDb rating on Wild wild west is 4.30."
    },
    {
        "input_text": "what was the rating on the movie Willow?"
    },
    {
        "target_text": "The IMDb rating on Willow is 7.10."
    },
    {
        "input_text": "what was the rating on the movie Witness?"
    },
    {
        "target_text": "The IMDb rating on Witness is 7.60."
    },
    {
        "input_text": "what was the rating on the movie The wizard of oz?"
    },
    {
        "target_text": "The IMDb rating on The wizard of oz is 8.30."
    },
    {
        "input_text": "what was the rating on the movie The world is not enough?"
    },
    {
        "target_text": "The IMDb rating on The world is not enough is 6.30."
    },
    {
        "input_text": "what was the rating on the movie Watchmen?"
    },
    {
        "target_text": "The IMDb rating on Watchmen is 7.80."
    },
    {
        "input_text": "what was the rating on the movie Xxx?"
    },
    {
        "target_text": "The IMDb rating on Xxx is 5.60."
    },
    {
        "input_text": "what was the rating on the movie X-men?"
    },
    {
        "target_text": "The IMDb rating on X-men is 7.40."
    },
    {
        "input_text": "what was the rating on the movie Young frankenstein?"
    },
    {
        "target_text": "The IMDb rating on Young frankenstein is 8.00."
    },
    {
        "input_text": "what was the rating on the movie Zulu dawn?"
    },
    {
        "target_text": "The IMDb rating on Zulu dawn is 6.40."
    }
]